** Solution
#+begin_src clojure
(defn bake-cake []
  (add-flour)
  (add-flour)
  (add-sugar)
  (add-milk)
  (add-egg)
  (add-egg)

  (mix)

  (pour-into-pan)
  (bake-pan 25)
  (cool-pan))
#+end_src

#+RESULTS:
: #'user/bake-cake

** solution
#+begin_src clojure
(defn add-squeezed [ingredient]
  (if (squeezed? ingredient)
    (do
      (grab ingredient)
      (squeeze)
      (add-to-bowl))
    (do
      (println "This function only works on squeezed ingredients. You asked me to squeeze" ingredient)
      :error)))

(defn add-scooped [ingredient]
  (if (scooped? ingredient)
    (do
      (grab :cup)
      (scoop ingredient)
      (add-to-bowl)
      (release))
    (do
      (println "This function only works on scooped ingredients. You asked me to scoop" ingredient)
      :error)))

(defn add-simple [ingredient]
  (if (simple? ingredient)
    (do
      (grab ingredient)
      (add-to-bowl))
    (do
      (println "This function only works on simple ingredients. You asked me to add" ingredient)
      :error)))
#+end_src

#+RESULTS:
: #'user/add-simple

** Solution
#+begin_src clojure
(defn bake-cake []
  (add :egg 2)
  (add :flour 2)
  (add :milk 1)
  (add :sugar 1)

  (mix)

  (pour-into-pan)
  (bake-pan 25)
  (cool-pan))
#+end_src

#+RESULTS:
: #'user/bake-cake

